Revit 2024 API
BuiltInFailures.SketchFailures.AxisNotSpecified Property
 Axis of revolution not specified.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId AxisNotSpecified { get; }
Visual Basic
Public Shared ReadOnly Property AxisNotSpecified As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ AxisNotSpecified {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace